import math
from mod import average

def calcul(m):
    z = math.sqrt(m) + 10
    return z


m = int(input("Введіть число: "))
print("Значення виразу z: ", calcul(m))

x = int(input("Введіть від якого числа (х) знаходити середє значення усіх парних чисел: "))
y = int(input("Введіть до якого числа (y) знаходити середє значення усіх парних чисел: "))

while x > y:
    x = int(input("у не може бути менше х, введіть ще раз від якого числа (х) знаходити середє значення усіх парних чисел: "))
    y = int(input("Введіть до якого числа (y) знаходити середє значення усіх парних чисел: "))

print("Середнє значення парних чисел від х до у: ", average(x, y))
